In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\manas\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\manas\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\manas\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\manas\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\manas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\manas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [3]:
l=[10,20,30,40]
s=pd.Series(l)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
l=[10,20,30,40]
s=pd.Series(l,index=["A","B","C","D"],name="python",dtype="float")
print(s)

A    10.0
B    20.0
C    30.0
D    40.0
Name: python, dtype: float64

In [6]:
d={"A":[10,20,30,40],"B":[100,200,300,400]}
s1=pd.Series(d)
print(s1)
print(type(s1))
print(s1["A"])

A        [10, 20, 30, 40]
B    [100, 200, 300, 400]
dtype: object
<class 'pandas.core.series.Series'>
[10, 20, 30, 40]

In [8]:
s=pd.Series(12,index=[1,2,3,4,5,6,7])
print(s)

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64

In [9]:
s1=pd.Series(12,index=[1,2,3,4,5,6,7])
s2=pd.Series(12,index=[1,2,3,4])
s3=s1+s2
print(s3)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [7]:
dic={"A":[10,20,30,40,50],"B":[100,200,300,400,500]}
df=pd.DataFrame(dic)
print(df)
print(type(df))
print(df["A"])

    A    B
0  10  100
1  20  200
2  30  300
3  40  400
4  50  500
<class 'pandas.core.frame.DataFrame'>
0    10
1    20
2    30
3    40
4    50
Name: A, dtype: int64

In [8]:
dic={"A":[10,20,30,40,50],"B":[100,200,300,400,500],
     1:[1000,2000,3000,4000,5000],"S":[1,2,3,4,5]}
df=pd.DataFrame(dic,columns=["A",1],index=["a","s","d","e","f"],dtype="float")
df

      A       1
a  10.0  1000.0
s  20.0  2000.0
d  30.0  3000.0
e  40.0  4000.0
f  50.0  5000.0

In [9]:
l=[[10,20,30,40,50],[100,200,300,400,500]]
df=pd.DataFrame(l)
df

     0    1    2    3    4
0   10   20   30   40   50
1  100  200  300  400  500

In [10]:
d={"A":pd.Series([1,2,3,4]),"B":pd.Series([1,2,3,4,5])}
df=pd.DataFrame(d)
print(df)
print()
print(df["A"][2])

     A  B
0  1.0  1
1  2.0  2
2  3.0  3
3  4.0  4
4  NaN  5

3.0

In [11]:
#arithmetic
df=pd.DataFrame({"A":[10,20,30,40,50],"B":[1,2,3,4,5]})
df

    A  B
0  10  1
1  20  2
2  30  3
3  40  4
4  50  5

In [12]:
df["C"]=df["A"]+df["B"]
df

    A  B   C
0  10  1  11
1  20  2  22
2  30  3  33
3  40  4  44
4  50  5  55

In [13]:
df["C"]=df["A"]-df["B"]
df

    A  B   C
0  10  1   9
1  20  2  18
2  30  3  27
3  40  4  36
4  50  5  45

In [14]:
df["C"]=df["A"]*df["B"]
df

    A  B    C
0  10  1   10
1  20  2   40
2  30  3   90
3  40  4  160
4  50  5  250

In [15]:
df["C"]=df["A"]/df["B"]
df

    A  B     C
0  10  1  10.0
1  20  2  10.0
2  30  3  10.0
3  40  4  10.0
4  50  5  10.0

In [16]:
df["C"]=df["A"]//df["B"]
df

    A  B   C
0  10  1  10
1  20  2  10
2  30  3  10
3  40  4  10
4  50  5  10

In [17]:
df["C"]=df["A"]**df["B"]
df

    A  B          C
0  10  1         10
1  20  2        400
2  30  3      27000
3  40  4    2560000
4  50  5  312500000

In [18]:
df["C"]=df["A"]%df["B"]
df

    A  B  C
0  10  1  0
1  20  2  0
2  30  3  0
3  40  4  0
4  50  5  0

In [19]:
df["python"]=df["A"]<=30
df

    A  B  C  python
0  10  1  0    True
1  20  2  0    True
2  30  3  0    True
3  40  4  0   False
4  50  5  0   False

In [20]:
df["python"]=df["A"]<=30
df["python_1"]=df["B"]>3
df

    A  B  C  python  python_1
0  10  1  0    True     False
1  20  2  0    True     False
2  30  3  0    True     False
3  40  4  0   False      True
4  50  5  0   False      True

In [21]:
df.insert(1,"python_3",d["A"])

In [22]:
df

    A  python_3  B  C  python  python_1
0  10       1.0  1  0    True     False
1  20       2.0  2  0    True     False
2  30       3.0  3  0    True     False
3  40       4.0  4  0   False      True
4  50       NaN  5  0   False      True

In [23]:
df.insert(2,"python_4",[10,20,30,40,50])

In [24]:
df

    A  python_3  python_4  B  C  python  python_1
0  10       1.0        10  1  0    True     False
1  20       2.0        20  2  0    True     False
2  30       3.0        30  3  0    True     False
3  40       4.0        40  4  0   False      True
4  50       NaN        50  5  0   False      True

In [25]:
del df["python"]

In [26]:
df

    A  python_3  python_4  B  C  python_1
0  10       1.0        10  1  0     False
1  20       2.0        20  2  0     False
2  30       3.0        30  3  0     False
3  40       4.0        40  4  0      True
4  50       NaN        50  5  0      True

In [29]:
#how to read csv
df=pd.read_csv(r"C:\Users\manas\Python-Decode\Cricket Project\t20i_Fow_Card.csv.xls")
df

       Match ID  innings        team   player  wicket  over   runs
0        291356        1       India   7781.0     1.0   0.5    5.0
1        291356        1       India   7773.0     2.0   1.4   12.0
2        291356        1       India   8813.0     3.0   2.6   20.0
3        291356        1       India   8742.0     4.0   3.2   20.0
4        291356        1       India  48405.0     5.0   6.4   32.0
...         ...      ...         ...      ...     ...   ...    ...
33088   1425127        1    Zimbabwe  66876.0     7.0  18.4  120.0
33089   1425127        2  Bangladesh  91219.0     1.0   5.5   41.0
33090   1425127        2  Bangladesh  70872.0     2.0   9.3   61.0
33091   1425127        2  Bangladesh  66691.0     3.0   9.6   62.0
33092   1425127        2  Bangladesh  80669.0     4.0  13.5   93.0

[33093 rows x 7 columns]

In [31]:
#how to write csv
df.to_csv(r"C:\Users\manas\Python-Decode\Cricket Project\t20i_Fow_Card.csv.xls")
df

       Match ID  innings        team   player  wicket  over   runs
0        291356        1       India   7781.0     1.0   0.5    5.0
1        291356        1       India   7773.0     2.0   1.4   12.0
2        291356        1       India   8813.0     3.0   2.6   20.0
3        291356        1       India   8742.0     4.0   3.2   20.0
4        291356        1       India  48405.0     5.0   6.4   32.0
...         ...      ...         ...      ...     ...   ...    ...
33088   1425127        1    Zimbabwe  66876.0     7.0  18.4  120.0
33089   1425127        2  Bangladesh  91219.0     1.0   5.5   41.0
33090   1425127        2  Bangladesh  70872.0     2.0   9.3   61.0
33091   1425127        2  Bangladesh  66691.0     3.0   9.6   62.0
33092   1425127        2  Bangladesh  80669.0     4.0  13.5   93.0

[33093 rows x 7 columns]

In [34]:
d={"A":pd.Series([1,2,3,4]),"B":pd.Series([1,2,3,4])}
df1=pd.DataFrame(d)
df1

   A  B
0  1  1
1  2  2
2  3  3
3  4  4